fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <tabularSections>
    <name>АбонентскиеДоговора</name>
    <attributes>
      <name>АбонентскийДоговор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>РеализацияТоваровИУслуг</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/Forms/Форма/Module.bsl
#Область ОбработчикиКомандФормы


&НаКлиенте
Процедура ДействующиеАбонентскиеДоговора(Команда)
	
	ДлительнаяОперация = ДействующиеАбонентскиеДоговораНаСервере(); 
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);	 
	ПараметрыОжидания.Интервал = 1;
	
	ОповещениеОЗавершение = Новый ОписаниеОповещения("ОповещениеОЗавершение",ЭтотОбъект);  
	ДлительныеОперацииКЛиент.ОжидатьЗавершение(ДлительнаяОперация,ОповещениеОЗавершение,ПараметрыОжидания);
	
КонецПроцедуры



#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Функция ДействующиеАбонентскиеДоговораНаСервере()
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор,"Обработки.ВКМ_МассовоеСозданиеАктов.ВыполнитьАвтозаполнениеМодМенеджера",Объект.Период); 
	
	Возврат ДлительнаяОперация;

КонецФункции

&НаКлиенте
Процедура ОповещениеОЗавершение(Результат,ДополнительныеПараметры) Экспорт 
	
	Если Результат.Статус = "Выполнено" Тогда
		ЗаполнитьТаблЧасть(ПолучитьИзВременногоХранилища(Результат.АдресРезультата));
//		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон("Результат тяжелой операции: %1",ПолучитьИзВременногоХранилища(Результат.АдресРезультата))); 
		
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ЗаполнитьТаблЧасть(Массив) Экспорт 
		
	Для СЧ = 1 ПО Массив[0].Количество() Цикл
		НоваяСтрока = Объект.АбонентскиеДоговора.Добавить(); 
		НоваяСтрока.АбонентскийДоговор = Массив[0][СЧ-1];
        НоваяСтрока.РеализацияТоваровИУслуг = Массив[1][СЧ-1];
	КонецЦикла;
	
КонецПроцедуры 
  
#КонецОбласти
